---
kind: method
id: M:Autodesk.Revit.DB.PointOnEdgeFaceIntersection.GetEdgeReference
source: html/9143b0e8-6bfd-a9df-0bbd-62bb2daa3892.htm
---
# Autodesk.Revit.DB.PointOnEdgeFaceIntersection.GetEdgeReference Method

Get a copy of the edge or curve reference.

## Syntax (C#)
```csharp
public Reference GetEdgeReference()
```